{
    "double_moving_average": "The double moving average strategy involves using two moving averages, a short-term and a long-term one, to identify buy or sell signals in financial markets. A bullish signal occurs when the short-term moving average crosses above the long-term moving average, suggesting an upward trend. Conversely, a bearish signal happens when the short-term moving average crosses below the long-term moving average, indicating a potential downward trend. Traders use these crossovers to make decisions on buying or selling, aiming to capitalize on sustained market movements. However, it's crucial to note that moving averages are lagging indicators, requiring careful risk management and market analysis for successful implementation.",

    "single_moving_average": "The single moving average strategy involves using a single moving average line to identify buy or sell signals in financial markets. This calculated average of an asset's price over a specified period, such as days, is commonly based on two moving averages: a short-term and a long-term moving average. A bullish signal occurs when the short-term crosses above the long-term, suggesting a potential uptrend, while a bearish signal happens when the short-term crosses below the long-term, indicating a potential downtrend. Traders interpret these crossovers to make buying or selling decisions, aiming to capture and benefit from sustained price movements. However, as moving averages are lagging indicators, careful risk management and market analysis are crucial for successful implementation.",

    "rsi": "The Relative Strength Index (RSI) strategy is a momentum-based approach that assesses the speed and change of price movements. RSI measures the magnitude of recent price changes to evaluate whether an asset is overbought or oversold. In this strategy, an RSI value above 70 suggests overbought conditions, indicating a potential upcoming reversal or correction. Conversely, an RSI below 30 indicates oversold conditions, suggesting a possible upward reversal. Traders use these RSI thresholds to make decisions on buying or selling, aiming to benefit from potential trend reversals. Like any strategy, careful risk management and market analysis are essential for successful implementation.",
    
    "mean_reversion" : "Mean Reversion strategy is a trading approach based on the assumption that asset prices will eventually revert to their historical average or mean. This strategy assumes that periods of price deviation from the mean will be followed by a return to average levels. Traders using mean reversion typically look for assets that have experienced significant price movements away from the historical mean and anticipate a correction. The strategy involves buying undervalued assets or selling overvalued ones with the expectation that prices will move back toward the average. It's crucial for traders to exercise caution and consider market conditions, as mean reversion may not always occur, and trends can persist. Successful implementation requires diligent risk management and analysis."
}